[
  {
    menu_name: "ต้มจืดเต้าหู้สาหร่าย",
    description: "เมนูทำทานง่าย",
    menu_image_url: "",
    calories: { value: 732, unit: "กิโลแคลอรี่" },
    process: "ต้ม",
    nationality: "ไทย",
    healthy_concern: ["เบาหวาน", "ความดัน", "หัวใจ", "ไต", "ลดน้ำหนัก", "อ้วน"],
    material: [
      { name: "หมูสับบด", quantity: 180, unit: "กรัม" },
      { name: "พริกไทยป่น", quantity: 150, unit: "กรัม" },
      { name: "ซอสถั่วเหลือง low sodium", quantity: 3, unit: "กรัม" },
      { name: "น้ำสะอาด", quantity: 1, unit: "ลิตร" },
      { name: "รสดีซุปก้อน รสหมู", quantity: 1, unit: "ก้อน" },
      { name: "กระเทียม", quantity: 15, unit: "กรัม" },
      { name: "รากผักชี", quantity: 5, unit: "กรัม" },
      { name: "น้ำปลา", quantity: 5, unit: "กรัม" },
      { name: "ผักกาดขาว", quantity: 90, unit: "กรัม" },
      { name: "สาหร่าย", quantity: 45, unit: "กรัม " },
      { name: "เต้าหู้ไข่", quantity: 270, unit: "กรัม" },
      { name: "ขึ้นฉ่าย", quantity: 30, unit: "กรัม" },
    ],
    cooking_step: [
      {
        order: 1,
        descriiption: "ผสมหมูบด พริกไทยป่น ซอสถั่วเหลือง คลุกเคล้าพอเข้ากัน",
      },
      {
        order: 2,
        descriiption:
          "ต้มน้ำสะอาด ใส่กระเทียม รากผักชี และ รสดีซุปก้อน รสหมู  พอเดือด ปั้นหมูบดที่หมักไว้เป็นก้อนกลมลงต้มพอสุก คอยช้อนฟองออก",
      },
      {
        order: 3,
        descriiption:
          "ปรุงรสด้วยน้ำปลา คนให้เข้ากัน ใส่ผักกาดขาว สาหร่าย เต้าหู้ไข่ โรยด้วยขึ้นฉ่าย รอให้เดือดสักครู่แล้วปิดไฟ",
      },
      {
        order: 4,
        descriiption: "ผสมหมูบด พริกไทยป่น ซอสถั่วเหลือง คลุกเคล้าพอเข้ากัน",
      },
    ],
  },
  {
    menu_name: "ผัดผักรวมมิตรกุ้ง",
    description: "เมนูแนะนำสำหรับผู้ป่วยเบาหวาน ระดับน้ำตาลและไขมันไม่สูง ",
    menu_image_url: "",
    calories: { value: 149, unit: "กิโลแคลอรี่" },
    process: "ผัด",
    nationality: "ไทย",
    healthy_concern: ["เบาหวาน", "ความดัน", "หัวใจ", "ไต", "ลดน้ำหนัก", "อ้วน"],
    material: [
      { name: "ข้าวโพดอ่อน", quantity: 70, unit: กรัม },
      { name: "ถั่วลันเตาหวาน", quantity: 80, unit: กรัม },
      { name: "แครอท", quantity: 40, unit: กรัม },
      { name: "กระเทียม", quantity: 15, unit: กรัม },
      { name: "น้ำมันรำข้าว", quantity: 1, unit: ช้อนโต๊ะ },
      { name: "ซอสถั่วเหลือง low sodium", quantity: 1, unit: ช้อนโต๊ะ },
      { name: "ซอสหอยนางรม low sodium", quantity: 1, unit: ช้อนชา },
      { name: "รสดี รสหมู สูตรลดโซเดียม", quantity: 1 / 2, unit: ช้อนโต๊ะ },
      { name: "น้ำตาลทราย", quantity: 1, unit: ช้อนชา },
      { name: "น้ำสะอาด", quantity: 2, unit: ช้อนโต๊ะ },
      { name: "กุ้ง", quantity: 80, unit: กรัม },
      { name: "ข้าวสวย", quantity: 340, unit: กรัม },
    ],
    cooking_step: [
      {
        order: 1,
        descriiption: "ตั้งกระทะ ใส่น้ำมันพอร้อน ใส่กระเทียมลงไปผัดให้เหลือง",
      },
      {
        order: 2,
        descriiption:
          "ใส่ข้าวโพดอ่อน ถั่วลันเตา และแครอท ผัดจนผักสุก ปรุงรสด้วย ซอสถั่วเหลือง ซอสหอยนางรม รสดี รสหมู สูตรลดโซเดียม และน้ำตาลทราย",
      },
      {
        order: 3,
        descriiption:
          "ใส่กุ้งลงผัด หากน้ำแห้งเกินไปให้เติมน้ำสะอาดไปเล็กน้อย ผัดให้เข้ากัน พอสุกตักเสิร์ฟ",
      },
    ],
  },
  {
    menu_name: "ปลาทูนึ่งซีอิ๊ว",
    description: "เมนูคลีนคลีน เอาใจคนรักสุขภาพ ",
    menu_image_url: "",
    calories: { value: 140, unit: "กิโลแคลอรี่" },
    process: "นึ่ง",
    nationality: "ไทย",
    healthy_concern: ["เบาหวาน", "ความดัน", "หัวใจ", "ไต", "ลดน้ำหนัก", "อ้วน"],
    material: [
      { name: "ปลาทูนึ่ง", quantity: 2, unit: ตัว },
      { name: "หอมใหญ่", quantity: 1, unit: หัว },
      { name: "น้ำสะอาด", quantity: 600, unit: มิลลิลิตร },
      { name: "ซอสหอยนางรม low sodium", quantity: 1, unit: ช้อนโต๊ะ },
      { name: "ซีอิ๊วดำ", quantity: 1, unit: ช้อนโต๊ะ },
      { name: "น้ำตาลทราย", quantity: 1, unit: ช้อนชา },
      { name: "ขิงแก่", quantity: 4, unit: แว่น },
      { name: "ดอกเกลือ", quantity: 1, unit: ช้อนชา },
      { name: "พริกไทยดำ", quantity: 1, unit: ช้อนชา },
      { name: "ผักชี", quantity: 10, unit: กรัม },
      { name: "พริกชี้ฟ้า", quantity: 10, unit: กรัม },
    ],
    cooking_step: [
      {
        order: 1,
        descriiption:
          "ทุบขิงแก่ในครกให้พอแหลก หรือหากใครชอบกลิ่นและความเผ็ดของขิงให้โขลกขิงให้ละเอียดขึ้น",
      },
      {
        order: 2,
        descriiption:
          "นำขิงจากข้อ 1 ดอกเกลือ และน้ำตาลทรายแดงลงกระทะเล็กก้นลึก",
      },
      {
        order: 3,
        descriiption:
          "ใส่หอมใหญ่เปิดเตาด้วยไฟแรง ใส่น้ำเปล่า 2 ถ้วย พอน้ำเดือดใส่ซีอิ๊วดำ / น้ำมันหอย / น้ำตาลปี๊บ หรี่ไฟลงเป็นปานกลาง ต้มต่อจนหอมใหญ่นิ่มและเปลี่ยนสี",
      },
      {
        order: 4,
        descriiption:
          "นำปลาทูนึ่งลงกระทะ หรี่ไฟอ่อน ต้มต่อจนปลาทูสีเข้มปรุงรสด้วยน้ำตาล เกลือและพริกไทย ให้หวานเค็มตามชอบยกเสิร์ฟ ตกแต่งหน้าด้วยพริกชี้ฟ้าและผักชี",
      },
    ],
  },
  {
    menu_name: "ผัดวุ้นเส้นเกาหลี",
    description: "อันยองงง เมนูเกาหลี low calories",
    menu_image_url: "",
    calories: { value: 242, unit: "กิโลแคลอรี่" },
    process: "ผัด",
    nationality: "เกาหลี",
    healthy_concern: ["เบาหวาน", "ความดัน", "หัวใจ", "ไต", "ลดน้ำหนัก", "อ้วน"],
    material: [
      { name: "สันในหมู", quantity: 100, unit: กรัม },
      { name: "เห็ดหอม", quantity: 4, unit: ดอก },
      { name: "ผักปวยเล้ง", quantity: 3, unit: ต้น },
      { name: "ผักกวางตุ้ง low sodium", quantity: 3, unit: ต้น },
      { name: "แครอท", quantity: 1 / 2, unit: หัว },
      { name: "หอมใหญ่", quantity: 1 / 2, unit: หัว },
      { name: "วุ้นเส้น", quantity: 200, unit: กรัม },
      { name: "กระเทียม", quantity: 15, unit: กรัม },
      { name: "ซอสถั่วเหลืองเกาหลี", quantity: 4, unit: ช้อนโต๊ะ },
      { name: "น้ำมันงา", quantity: 5, unit: กรัม },
      { name: "เกลือ", quantity: 1 / 4, unit: กรัม },
      { name: "พริกไทยดำ", quantity: 1, unit: กรัม },
      { name: "งาขาวคั่ว", quantity: 1, unit: ช้อนโต๊ะ },
      { name: "งาดำคั่ว", quantity: 1, unit: ช้อนโต๊ะ },
      { name: "น้ำตาลทราย", quantity: 2, unit: ช้อนโต๊ะ },
      { name: "น้ำตาลทรายแดง", quantity: 1, unit: ช้อนโต๊ะ },
    ],
    cooking_step: [
      {
        order: 1,
        descriiption:
          "ลวกผักปวยเล้ง และผักกวางตุ้ง ในน้ำเดือดให้พอสลด แล้วนำไปแช่น้ำเย็นเพื่อไม่ให้สุกเกินไป ยกขึ้นสะเด็ดน้ำ ตัดเป็นท่อน ๆ แล้วปรุงรสด้วยน้ำมันงา 1 ช้อนชา น้ำตาล ½ ช้อนชา และเกลือ ¼ ช้อนชา ",
      },
      {
        order: 2,
        descriiption:
          "หั่นสันในหมูให้เป็นชิ้นพอดีคำ แล้วหมักด้วยซอสถั่วเหลืองเกาหลี 1 ช้อนโต๊ะ น้ำมันงา 1 ช้อนชา น้ำตาลทราย ½ ช้อนโต๊ะ และกระเทียมสับ 1 ช้อนชา คลุกให้เข้ากัน แล้วหมักไว้ 10 นาที",
      },
      {
        order: 3,
        descriiption:
          "หั่นเห็ดหอมแห้งแช่น้ำ แล้วนำไปคลุกกับซอสถั่วเหลืองเกาหลี ½ ช้อนโต๊ะ น้ำมันงา 1 ช้อนชา น้ำตาลทราย ½ ช้อนโต๊ะ และกระเทียมสับ 1 ช้อนชา คลุกให้เข้ากัน",
      },
      { order: 4, descriiption: "นำ วุ้นเส้น ตราต้นสน ไปแช่น้ำจนนิ่ม" },
      {
        order: 5,
        descriiption:
          "ตั้งกระทะ ใส่น้ำมันเล็กน้อย ผัดแครอทหั่นท่อนให้สุก แล้วนำขึ้นพักไว้ ตั้งกระทะอีกรอบ ใส่หัวหอมหั่นท่อน ลงไปผัดจนสุกใส ตักขึ้นพักไว้",
      },
      {
        order: 6,
        descriiption:
          "ตั้งกระทะ ใส่น้ำมันเล็กน้อย ผัดเนื้อหมูที่หมักไว้ให้สุก แล้วตักขึ้นพักไว้ ตั้งกระทะอีกรอบ ใส่เห็ดที่ปรุงรสไว้ลงไป ผัดให้สุกแล้วตักขึ้นพักไว้",
      },
      {
        order: 7,
        descriiption:
          "ตั้งกระทะอีกครั้งใส่น้ำมันเล็กน้อย นำ วุ้นเส้น ตราต้นสน ที่แช่น้ำไว้มาผัด ปรุงรสด้วยซอสถั่วเหลืองเกาหลี 2 ช้อนโต๊ะ น้ำมันงา 1 ช้อนชา และน้ำตาลทรายแดง 1 ช้อนโต๊ะ ผัดจนสุกนิ่มแล้วตักขึ้นพักไว้",
      },
      {
        order: 8,
        descriiption:
          "นำส่วนผสมที่เตรียมไว้ทั้งหมด (วุ้นเส้นผัด ผักปวยเล้ง ผักกวางตุ้ง แครอทผัด หัวหอมผัด เห็ดหอมผัด และหมูหมักผัด) ใส่ลงในชามผสม ตามด้วยพริกไทยดำป่น งาขาวและงาดำคั่ว คลุกผสมให้เข้ากันทั้งหมด",
      },
    ],
  },
  {
    menu_name: "เนื้อย่างบุลโกกิ",
    description: "อันยองงง เมนูเกาหลี low calories",
    menu_image_url: "",
    calories: { value: 290, unit: "กิโลแคลอรี่" },
    process: "ย่าง",
    nationality: "เกาหลี",
    healthy_concern: ["เบาหวาน", "ความดัน", "หัวใจ", "ไต", "ลดน้ำหนัก", "อ้วน"],
    material: [
      { name: "เนื้อสันแหลม", quantity: 350, unit: กรัม },
      { name: "หอมใหญ่", quantity: 40, unit: กรัม },
      { name: "กระเทียม", quantity: 15, unit: กรัม },
      { name: "สาลี่หิมะ", quantity: 60, unit: กรัม },
      { name: "ต้นหอม", quantity: 15, unit: กรัม },
      { name: "น้ำตาลทรายแดง", quantity: 3, unit: ช้อนโต๊ะ },
      { name: "พริกไทยดำ", quantity: 1, unit: กรัม },
      { name: "ซอสถั่วเหลืองเกาหลี", quantity: 5, unit: ช้อนโต๊ะ },
      { name: "น้ำมันงา", quantity: 3, unit: ช้อนโต๊ะ },
      { name: "น้ำมันพืช", quantity: 2, unit: ช้อนโต๊ะ },
      { name: "งาขาวคั่ว", quantity: 2, unit: ช้อนโต๊ะ },
    ],
    cooking_step: [
      {
        order: 1,
        descriiption: "หั่นเนื้อสันแหลมเป็นชิ้นตามแนวขวาง แล้วพักไว้",
      },
      {
        order: 2,
        descriiption:
          "ใส่หอมหัวใหญ่หั่นเต๋า กระเทียม สาลี่หิมะหั่นเต๋า ต้นหอมหั่นท่อน น้ำตาลทรายแดง พริกไทยป่น ซอสถั่วเหลือง และน้ำมันงา ลงในเครื่องปั่น ปั่นให้ละเอียดเป็นซอส ",
      },
      {
        order: 3,
        descriiption:
          "นำซอสที่ได้ไปเทลงในเนื้อสันแหลมที่หั่นไว้ ใส่หอมหัวใหญ่หั่นเสี้ยว คลุกให้เข้ากัน หมักทิ้งไว้ 20 นาที ",
      },
      {
        order: 4,
        descriiption:
          "ตั้งกระทะบนเตา ใช้ไฟกลางค่อนแรง ใส่น้ำมันลงไป รอจนน้ำมันร้อน แล้วใส่เนื้อที่หมักไว้ลงไป ผัดจนหอมหัวใหญ่สุกใส และตัวซอสหมักเริ่มเปลี่ยนเป็นสีเข้มขึ้น ",
      },
      {
        order: 5,
        descriiption: "โรยต้นหอมซอย งาขาวคั่ว ผัดให้เข้ากันเล็กน้อย ",
      },
    ],
  },
  {
    menu_name: "สปาเก้ตตี้คาโบนาร่า",
    description: "",
    menu_image_url: "",
    calories: { value: 317, unit: "กิโลแคลอรี่" },
    process: "ผัด",
    nationality: "อิตาเลี่ยน",
    healthy_concern: ["เบาหวาน", "ความดัน", "หัวใจ", "ไต", "ลดน้ำหนัก", "อ้วน"],
    material: [
      { name: "เส้นสปาเก็ตตี้", quantity: 100, unit: กรัม },
      { name: "เบคอน", quantity: 150, unit: กรัม },
      { name: "พาเมซานชีส", quantity: 40, unit: กรัม },
      { name: "ไข่ไก่ ", quantity: 4, unit: ฟอง },
      { name: "เกลือ", quantity: 1, unit: ช้อนชา },
      { name: "น้ำสะอาด", quantity: 50, unit: มิลลิลิตร },
    ],
    cooking_step: [
      { order: 1, descriiption: "นำเบคอนมาหั่นเป็นชิ้นขนาดตามต้อมการ" },
      {
        order: 2,
        descriiption:
          "นำไข่ไก่สดมาแยกไข่แดงออกจากไข่ขาว โดยใช้เฉพาะไข่แดงอย่างเดียว 3 ฟอง และไข่ไก่ทั้งใบ 1 ฟอง",
      },
      {
        order: 3,
        descriiption:
          "นำพาเมซานชีสที่ขูดแล้วมาผสมกับไข่ไก่ จากนั้นใส่พริกไทย และเกลือ คนผสมให้เข้ากัน",
      },
      {
        order: 4,
        descriiption:
          "ต้มน้ำให้เดือด แล้วใส่เกลือลงไป จากนั้นใส่เส้นสปาเก็ตตี้ลงไปต้ม ใช้เวลาต้มประมาณ 6 นาที",
      },
      {
        order: 5,
        descriiption:
          "นำเบคอนมาผัดในกระทะจนเหลืองหอม และเริ่มมีน้ำมันออกมา จากนั้นใส่เส้นสปาก็ตตี้ที่ต้มเสร็จแล้วลงไป ผัดจนน้ำมันเบคอนเคลือบเส้นดี เติมน้ำเดือดที่ใช้ต้มเส้นลงไปเล็กน้อย",
      },
      {
        order: 6,
        descriiption:
          "ปิดเตาแก๊ส จากนั้นใส่ส่วนผสมของไข่และชีสลงไป แล้วคลุกเคล้าให้เข้ากับเส้นสปาเก็ตตี้",
      },
    ],
  },
];
